#+title: Chapter 1 Exercises
#+property: header-args :session :results value

#+begin_src scheme
(use-modules (sicp-test))
#+end_src

** Solution
#+begin_src scheme
  10
  12
  8
  3
  6


  19
  #f
  4
  16
  6
  16
#+end_src

#+RESULTS:
: 16

** Solution
#+begin_src scheme
(/
 (+ 5 4 (- 2 (- 3 (+ 6 (/ 4 5)))))
 (* 3 (- 6 2) (- 2 7)))
#+end_src

#+RESULTS:
: -37/150

** Solution
#+begin_src scheme :session :results output
(define (weird-sum-of-squares a b c)
  (define x (if (> a b) a b))
  (define y (cond
             ((or (> c a) (> c b)) c)
             ((< a  b) a)
             (else b)))
  (+ (* x x) (* y y)))

(assert
 (=
  25
  (weird-sum-of-squares 2 3 4)
  (weird-sum-of-squares 2 4 3)
  (weird-sum-of-squares 3 2 4)
  (weird-sum-of-squares 3 4 2)
  (weird-sum-of-squares 4 2 3)
  (weird-sum-of-squares 4 3 2)))
(display "Ok!")
#+end_src

#+RESULTS:
: Ok!


* Exercise 1.6
Alyssa P. Hacker doesn't see why if needs to be provided as a special form. “Why can’t I just define it as an ordinary procedure in terms of cond?” she asks. Alyssa’s friend Eva Lu Ator claims this can indeed be done, and she defines a new version of if:

#+begin_src scheme
(define (new-if predicate
                then-clause
                else-clause)
  (cond (predicate 'then-clause)
        (else 'else-clause)))

(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x) x)))

#+end_src

#+RESULTS:
: #<unspecified>

Eva demonstrates the program for Alyssa:

#+begin_src scheme
  (new-if (= 2 3) 0 5)
  5

  (new-if (= 1 1) 0 5)
  0
#+end_src

#+RESULTS:
: 0

Delighted, Alyssa uses new-if to rewrite the square-root program:

#+begin_src scheme
(define (sqrt-iter guess x)
  (new-if (good-enough? guess x)
          guess
          (sqrt-iter (improve guess x) x)))
#+end_src

#+RESULTS:
: #<unspecified>

What happens when Alyssa attempts to use this to compute square roots? Explain.

** Solution
#+begin_src scheme :session :results output
(define (good-enough? last-guess guess)
  (< (abs (- 1 (/ last-guess guess))) 0.001))

(define (improve guess x)
  (/ (+ guess (/ x guess)) 2))

(define (sqrt-iter x last-guess guess)
  (if (good-enough? last-guess guess)
      guess
      (sqrt-iter x guess (improve guess x))))

(define (sqrt x)
  (sqrt-iter x 0.0 1.0))

(assert-approximation 100000.0 (sqrt 10000000000.0))
(display "Ok!")
#+end_src

#+RESULTS:
: Ok!


** Solution
#+begin_src scheme :session :results output
(define (improve-cube-root-guess y x)
  (/ (+ (/ x (* y y)) (* 2 y)) 3))

(define (cube-root-iter x last-guess guess)
  (if (good-enough? last-guess guess)
      guess
      (cube-root-iter x guess (improve-cube-root-guess guess x))))

(define (cube-root x)
  (cube-root-iter x 0.0 1.0))

(assert-approximation 3 (cube-root 27))
(display "Ok!")
#+end_src

#+RESULTS:
: Ok!

* Exercise 1.10
The following procedure computes a mathematical function called Ackermann’s function.
#+begin_src scheme :session
(define (A x y)
  (cond ((= y 0) 0)
        ((= x 0) (* 2 y))
        ((= y 1) 2)
        (else (A (- x 1)
                 (A x (- y 1))))))
#+end_src

What are the values of the following expressions?
#+begin_src scheme :session
  (A 1 10)
  (A 2 4)
  (A 3 3)
#+end_src

#+RESULTS:
: 65536

Consider the following procedures, where A is the procedure defined above:
#+begin_src scheme :session
  (define (f n) (A 0 n))
  (define (g n) (A 1 n))
  (define (h n) (A 2 n))
  (define (k n) (* 5 n n))
#+end_src

Give concise mathematical definitions for the functions computed by the procedures f, g, and h for positive integer values of n. For example, (k n) computes 5n^2.

** Solution
#+name: recursive
#+begin_src scheme :session :results output
(define (f n)
  (if (< n 3)
      n
      (+
       (f (- n 1))
       (* 2 (f (- n 2)))
       (* 3 (f (- n 3))))))

(assert-equal 0 (f 0))
(assert-equal 1 (f 1))
(assert-equal 2 (f 2))
(assert-equal 4 (f 3))
(assert-equal 11 (f 4))
(assert-equal 25 (f 5))
(display "Ok!")
#+end_src

#+RESULTS: recursive
: Ok!

#+name: iterative
#+begin_src scheme :results output
(define (f n)
  (define (f-step n-1 n-2 n-3)
    (+ n-1 (* 2 n-2) (* 3 n-3)))
  (define (f-iter n-1 n-2 n-3 count)
    (if (= count 0)
        n-1
        (f-iter (f-step n-1 n-2 n-3) n-1 n-2 (- count 1))))
  (if (< n 3)
      n
      (f-iter 2 1 0 (- n 2))))

(assert-equal 0 (f 0))
(assert-equal 1 (f 1))
(assert-equal 2 (f 2))
(assert-equal 4 (f 3))
(assert-equal 11 (f 4))
(assert-equal 25 (f 5))
(display "Ok!")
#+end_src

#+RESULTS: iterative
: Ok!

** Solution
#+begin_src scheme :results output
(define (pascal-triangle r k)
  (if (or (= r 1) (< k 2) (>= k r))
       1
       (+
        (pascal-triangle (- r 1) (- k 1))
        (pascal-triangle (- r 1) k))))

(assert-equal 6 (pascal-triangle 5 3))
(display "Ok!")
#+end_src

#+RESULTS:
: Ok!

